dulgerov/OpenSprinkler-Firmware-ESP32-more-MQTT/OpenSprinkler.cpp
// string options do not have prompts

/** Option maximum values (stored in PROGMEM to reduce RAM usage) */
const unsigned char iopt_max[] PROGMEM = {
	0,
	108,
	1,
	1,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	0,
	MAX_EXT_BOARDS,
	1,
	255,
	MAX_NUM_STATIONS,
	255,
	255,
	255,
	1,
	250,
	1,
	1,
	255,
	255,
	255,
	255,
	250,
	255,
	255,
	255,
	255,
	255,
	1,
	MAX_NUM_STATIONS,
	255,
	255,
	0,
	255,
	255,
	1,
	255,
	255,
	255,
	255,
	1,
	255,
	255,
	1,
	255,
	1,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	1,
	24,
	24,
	255,
	255,
	255,
	255,
	255,
	255,
	255,
	1
};

// string options do not have maximum values

/** Integer option values (stored in RAM) */
unsigned char OpenSprinkler::iopts[] = {
	OS_FW_VERSION, // firmware version
	28, // default time zone: GMT-5
	1,  // 0: disable NTP sync, 1: enable NTP sync
	1,  // 0: use static ip, 1: use dhcp
	0,  // this and next 3 bytes define static ip
	0,
	0,
	0,
	0,  // this and next 3 bytes define static gateway ip
	0,
	0,
	0,
#if defined(ARDUINO)  // on AVR, the default HTTP port is 80
	80, // this and next byte define http port number
	0,
#else // on RPI/LINUX, the default HTTP port is 8080
	144,// this and next byte define http port number
	31,
#endif
	OS_HW_VERSION,
	0,  // number of 8-station extension board. 0: no extension boards
	1,  // the option 'sequential' is now retired
	120,// station delay time (-10 minutes to 10 minutes).
	0,  // index of master station. 0: no master station
	120,// master on time adjusted time (-10 minutes to 10 minutes)
	120,// master off adjusted time (-10 minutes to 10 minutes)
	0,  // urs (retired)
	0,  // rso (retired)
	100,// water level (default 100%),
	1,  // device enable
	0,  // 1: ignore password; 0: use password
	0,  // device id
	150,// lcd contrast
	100,// lcd backlight
	#if defined(ESP32)
	40,
	#else
	15, // lcd dimming
	#endif
	80, // boost time (only valid to DC and LATCH type)
	0,  // weather algorithm (0 means not using weather algorithm)
	0,  // this and the next three bytes define the ntp server ip
	0,
	0,
	0,
	1,  // enable logging: 0: disable; 1: enable.
	0,  // index of master2. 0: no master2 station
	120,// master2 on adjusted time
	120,// master2 off adjusted time
	OS_FW_MINOR, // firmware minor version
	100,// this and next byte define flow pulse rate (100x)
	0,  // default is 1.00 (100)
	0,  // set as remote extension
	8,  // this and the next three bytes define the custom dns server ip
	8,
	8,
	8,
	0,  // special station auto refresh
	0,  // notif enable bits
	0,  // sensor 1 type (see SENSOR_TYPE macro defines)
	1,  // sensor 1 option. 0: normally closed; 1: normally open.	default 1.
	0,  // sensor 2 type
	1,  // sensor 2 option. 0: normally closed; 1: normally open. default 1.
	0,  // sensor 1 on delay
	0,  // sensor 1 off delay
	0,  // sensor 2 on delay
	0,  // sensor 2 off delay
	255,// subnet mask 1
	255,// subnet mask 2
	255,// subnet mask 3
	0,
	1,  // force wired connection
	0,  // latch on volt
	0,  // latch off volt
	0,  // notif enable bits 2
	0,  // reserved 4
	0,  // reserved 5
	0,  // reserved 6
	0,  // reserved 7
	0,  // reserved 8
	WIFI_MODE_AP, // wifi mode
	0   // reset
};

/** String option values (stored in RAM) */
const char *OpenSprinkler::sopts[] = {
	DEFAULT_PASSWORD,
	DEFAULT_LOCATION,
	DEFAULT_JAVASCRIPT_URL,
	DEFAULT_WEATHER_URL,
	DEFAULT_EMPTY_STRING, // SOPT_WEATHER_OPTS
	DEFAULT_EMPTY_STRING, // SOPT_IFTTT_KEY
	DEFAULT_EMPTY_STRING, // SOPT_STA_SSID
	DEFAULT_EMPTY_STRING, // SOPT_STA_PASS
	DEFAULT_EMPTY_STRING, // SOPT_MQTT_OPTS
	DEFAULT_EMPTY_STRING, // SOPT_OTC_OPTS
	DEFAULT_DEVICE_NAME,
	DEFAULT_EMPTY_STRING, // SOPT_STA_BSSID_CHL
	DEFAULT_EMPTY_STRING, // SOPT_EMAIL_OPTS
};

#if defined(BOOT_MENU_V2)

// Submenu for first menu set
MenuItem bootMenuSetup[] = {
  {"Submenu Item 1.1", nullptr, 0, -1,nullptr,false},
  {"Submenu Item 1.2", nullptr, 0, -1,nullptr,false},
  {"Submenu Item 1.3", nullptr, 0, -1,nullptr,false},
  {"<== Back ", nullptr, 0, -1,nullptr,false},
};

// First menu set
MenuItem bootMenu[] = {
  {" === Setup ===", bootMenuSetup, sizeof(bootMenuSetup) / sizeof(bootMenuSetup[0]), -1, nullptr, false},
  {"Device PW Reset?", nullptr, 0, -1,nullptr,false},
  {" Factory reset?", nullptr, 0, -1,OpenSprinkler::pre_factory_reset,true},
  {" Internal test", nullptr, 0, -1,OpenSprinkler::set_test_mode,false},
  {"  == Exit ==", nullptr, 0, -1,nullptr,false},
};

#endif

/** Weekday strings (stored in PROGMEM to reduce RAM usage) */
static const char days_str[] PROGMEM =
	"Mon\0"
	"Tue\0"
	"Wed\0"
	"Thu\0"
	"Fri\0"
	"Sat\0"
	"Sun\0";


#if !defined(ARDUINO)
static inline int32_t now() {
    time_t rawtime;
    time(&rawtime);
    return rawtime;
}
#endif
/** Calculate local time (UTC time plus time zone offset) */
time_os_t OpenSprinkler::now_tz() {
	return now()+(int32_t)3600/4*(int32_t)(iopts[IOPT_TIMEZONE]-48);
}

#if defined(ARDUINO)

bool detect_i2c(int addr) {
	Wire.beginTransmission(addr);
	return (Wire.endTransmission()==0); // successful if received 0
}

/** read hardware MAC into tmp_buffer */
#define MAC_CTRL_ID 0x50
bool OpenSprinkler::load_hardware_mac(unsigned char* buffer, bool wired) {
#if defined(ESP8266)
	WiFi.macAddress((unsigned char*)buffer);
	// if requesting wired Ethernet MAC, flip the last byte to create a modified MAC
	if(wired) buffer[5] = ~buffer[5];
	return true;
#elif defined(ESP32)
	WiFi.macAddress((unsigned char*)buffer);
	// if requesting wired Ethernet MAC, flip the last byte to create a modified MAC
	if(wired) buffer[5] = ~buffer[5];
	return true;
#else
	// initialize the buffer by assigning software mac
	buffer[0] = 0x00;
	buffer[1] = 0x69;
	buffer[2] = 0x69;
	buffer[3] = 0x2D;
	buffer[4] = 0x31;
	buffer[5] = iopts[IOPT_DEVICE_ID];
	if (detect_i2c(MAC_CTRL_ID)==false)	return false;

	Wire.beginTransmission(MAC_CTRL_ID);
	Wire.write(0xFA); // The address of the register we want
	Wire.endTransmission(); // Send the data
	if(Wire.requestFrom(MAC_CTRL_ID, 6) != 6) return false;	// if not enough data, return false
	for(unsigned char ret=0;ret<6;ret++) {
		buffer[ret] = Wire.read();
	}
	return true;
#endif
}

void(* resetFunc) (void) = 0; // AVR software reset function

/** Initialize network with the given mac address and http port */

unsigned char OpenSprinkler::start_network() {
	lcd_print_line_clear_pgm(PSTR("Starting..."), 1);
	uint16_t httpport = (uint16_t)(iopts[IOPT_HTTPPORT_1]<<8) + (uint16_t)iopts[IOPT_HTTPPORT_0];

#ifdef ENABLE_DEBUG
#if defined(ESP32)
  //DEBUG_PRINTLN(F("ESP32 FS dir:"));
  ESP32_FS_list_dir();
  DEBUG_PRINTLN(F("Starting network"));
#endif //ESP32
#endif 

#if defined(ESP8266) || defined(ESP32)

	#if defined(ESP32)
		useEth = false;
	#else
	if (start_ether()) {
		useEth = true;
		WiFi.mode(WIFI_OFF);
	} else {
		useEth = false;
	}
	#endif

