dulgerov/OpenSprinkler-Firmware-ESP32-more-MQTT/OpenSprinkler.cpp
    hw_type = HW_TYPE_AC;
    
	PIN_RFRX = E0_PIN_RFRX;
	PIN_RFTX = E0_PIN_RFTX;
	PIN_BOOST = E0_PIN_BOOST;
	PIN_BOOST_EN = E0_PIN_BOOST_EN;
	PIN_SENSOR1 = E0_PIN_SENSOR1;
	PIN_SENSOR2 = E0_PIN_SENSOR2;
  
	/*
	#if defined(ETHPORT)
		hw_rev = 2;
	#else
		hw_rev = 0;
	#endif
 	*/
 	hw_rev = 0;
	  // mainio = new IOEXP(ACDR_I2CADDR); // dont need this as all is handled by ESP32 gpio's

  #if ! defined(USE_IOEXP_SR) || ( defined(USE_IOEXP_SR) && USE_IOEXP_SR != 1 )
  	DEBUG_PRINTLN("Using GPIO IOEXP");
	drio = new BUILD_IN_GPIO(); // to handle gpio's on ESP32 board
	drio->set_pins_output_mode();
  #else
  	DEBUG_PRINTLN(F("Using Shift-register IOEXP"));
	drio = new IOEXP_SR();
	DEBUG_PRINTLN(F("Driver class initiated"));
	drio->set_pins_output_mode();
	DEBUG_PRINTLN("PIN SETUP COMPLETE");
  #endif	
	// ROTARY ENCODER not supported now
	#if ! defined(USE_ROTARY_ENCODER)
		PIN_BUTTON_1 = E0_PIN_BUTTON_1;
		PIN_BUTTON_2 = E0_PIN_BUTTON_2;
		PIN_BUTTON_3 = E0_PIN_BUTTON_3;
		
		pinMode(PIN_BUTTON_1, INPUT_PULLUP);
		pinMode(PIN_BUTTON_2, INPUT_PULLUP);
		pinMode(PIN_BUTTON_3, INPUT_PULLUP);
	#else
		DEBUG_PRINTLN(F("Rotary encoder enabled"));
		PIN_BUTTON_1 = ROTARY_ENCODER_A_PIN;
		PIN_BUTTON_2 = ROTARY_ENCODER_BUTTON_PIN;
		PIN_BUTTON_3 = ROTARY_ENCODER_B_PIN;

		pinMode(PIN_BUTTON_1, INPUT_PULLUP);
		pinMode(PIN_BUTTON_2, INPUT_PULLUP);
		pinMode(PIN_BUTTON_3, INPUT_PULLUP);

		attachInterrupt(digitalPinToInterrupt(ROTARY_ENCODER_A_PIN), OpenSprinkler::handleEncoder, CHANGE);

	#endif

	/* TODO - interrupt driven button/rotary encoder */

	/* detect expanders */
	for(byte i=0;i<(MAX_NUM_BOARDS)/2;i++)
		expanders[i] = NULL;
	DEBUG_PRINTLN("Starting to detect expanders");
	detect_expanders();

	DEBUG_PRINT("hw_type = "); DEBUG_PRINT(hw_type); DEBUG_PRINT(" hw_rev = "); DEBUG_PRINTLN(hw_rev);
#else

	// shift register setup
	pinMode(PIN_SR_OE, OUTPUT);
	// pull shift register OE high to disable output
	digitalWrite(PIN_SR_OE, HIGH);
	pinMode(PIN_SR_LATCH, OUTPUT);
	digitalWrite(PIN_SR_LATCH, HIGH);

	pinMode(PIN_SR_CLOCK, OUTPUT);

	#if defined(OSPI)
		pin_sr_data = PIN_SR_DATA;
		// detect RPi revision
		unsigned int rev = detect_rpi_rev();
		if (rev==0x0002 || rev==0x0003)
			pin_sr_data = PIN_SR_DATA_ALT;
		// if this is revision 1, use PIN_SR_DATA_ALT
		pinMode(pin_sr_data, OUTPUT);
	#else
		pinMode(PIN_SR_DATA, OUTPUT);
	#endif

#endif

#if defined(OSPI)
pinModeExt(PIN_BUTTON_1, INPUT_PULLUP);
pinModeExt(PIN_BUTTON_2, INPUT_PULLUP);
pinModeExt(PIN_BUTTON_3, INPUT_PULLUP);
#endif

	// init masters_last_on array
	memset(masters_last_on, 0, sizeof(masters_last_on));
	// Reset all stations
	clear_all_station_bits();
	apply_all_station_bits();

#if defined(ESP8266) || defined(ESP32)
	// OS 3.0 has two independent sensors
	pinModeExt(PIN_SENSOR1, INPUT_PULLUP);
	pinModeExt(PIN_SENSOR2, INPUT_PULLUP);
	
	DEBUG_PRINTLN("Starting sensors - INPUT_PULLUP");
 	DEBUG_PRINT("Sensor1 PIN: "); DEBUG_PRINTLN(PIN_SENSOR1);
  	DEBUG_PRINT("Sensor2 PIN: "); DEBUG_PRINTLN(PIN_SENSOR2);
#else
	// pull shift register OE low to enable output
	digitalWrite(PIN_SR_OE, LOW);
	// Rain sensor port set up
	pinMode(PIN_SENSOR1, INPUT_PULLUP);
	#if defined(PIN_SENSOR2)
	pinMode(PIN_SENSOR2, INPUT_PULLUP);
	#endif
#endif

	// Default controller status variables
	// Static variables are assigned 0 by default
	// so only need to initialize non-zero ones
	status.enabled = 1;
	status.safe_reboot = 0;

	old_status = status;

	nvdata.sunrise_time = 360;  // 6:00am default sunrise
	nvdata.sunset_time = 1080;  // 6:00pm default sunset
	nvdata.reboot_cause = REBOOT_CAUSE_POWERON;

	nboards = 1;
	nstations = nboards*8;

	// set rf data pin, unless it is not being used
	if(PIN_RFTX != 255) {
		pinModeExt(PIN_RFTX, OUTPUT);
		digitalWriteExt(PIN_RFTX, LOW);
	}

	DEBUG_PRINTLN("Starting RFTX pins ");
  	DEBUG_PRINT("RFTX PIN: "); DEBUG_PRINTLN(PIN_RFTX);

#if defined(ARDUINO)  // AVR SD and LCD functions

	#if defined(ESP8266) || defined(ESP32)  // OS3.0 specific detections
		#if PIN_CURR_SENSE != 255
		status.has_curr_sense = 1;  // OS3.0 has current sensing capacility
		# else
		status.has_curr_sense = 0;  // OS3.0 has current sensing capacility
		#endif
		// measure baseline current
		baseline_current = 80;

	#else // OS 2.3 specific detections

		// detect hardware type
		if (detect_i2c(MAC_CTRL_ID)) {
			Wire.beginTransmission(MAC_CTRL_ID);
			Wire.write(0x00);
			Wire.endTransmission();
			Wire.requestFrom(MAC_CTRL_ID, 1);
			unsigned char ret = Wire.read();
			if (ret == HW_TYPE_AC || ret == HW_TYPE_DC || ret == HW_TYPE_LATCH) {
				hw_type = ret;
			} else {
				hw_type = HW_TYPE_AC; // if type not supported, make it AC
			}
		}

		if (hw_type == HW_TYPE_DC) {
			pinMode(PIN_BOOST, OUTPUT);
			digitalWrite(PIN_BOOST, LOW);

			pinMode(PIN_BOOST_EN, OUTPUT);
			digitalWrite(PIN_BOOST_EN, LOW);
		}

		// detect if current sensing pin is present
		pinMode(PIN_CURR_DIGITAL, INPUT);
		digitalWrite(PIN_CURR_DIGITAL, HIGH); // enable internal pullup
		status.has_curr_sense = digitalRead(PIN_CURR_DIGITAL) ? 0 : 1;
		digitalWrite(PIN_CURR_DIGITAL, LOW);
		baseline_current = 0;

	#endif
#endif
#if defined(USE_DISPLAY)
	lcd_start();

	#if defined(USE_SSD1306) || defined(USE_SH1106)
		lcd.createChar(ICON_ETHER_CONNECTED, _iconimage_ether_connected);
		lcd.createChar(ICON_ETHER_DISCONNECTED, _iconimage_ether_disconnected);
		lcd.createChar(ICON_WIFI_CONNECTED, _iconimage_wifi_connected);
		lcd.createChar(ICON_WIFI_DISCONNECTED, _iconimage_wifi_disconnected);
	#elif defined(USE_LCD)
		lcd.createChar(ICON_ETHER_CONNECTED, _iconimage_connected);
		lcd.createChar(ICON_ETHER_DISCONNECTED, _iconimage_disconnected);
	#endif

	lcd.createChar(ICON_REMOTEXT, _iconimage_remotext);
	lcd.createChar(ICON_RAINDELAY, _iconimage_raindelay);
	lcd.createChar(ICON_RAIN, _iconimage_rain);
	lcd.createChar(ICON_SOIL, _iconimage_soil);
#endif

#if defined(ARDUINO)

	#if defined(ESP8266) || defined(ESP32)

		/* create custom characters */
		lcd.createChar(ICON_WIFI_CONNECTED, _iconimage_wifi_connected);
		lcd.createChar(ICON_WIFI_DISCONNECTED, _iconimage_wifi_disconnected);

		lcd.setCursor(0,0);
		lcd.print(F("Init file system"));
		DEBUG_PRINT("Init file system... ");
		lcd.setCursor(0,1);
		lcd.print(F("Please wait..."));
		#if defined(ESP8266)
		if(!LittleFS.begin()) {
		#elif defined(ESP32)
			// Get the size of the flash memory
			uint32_t flash_size = ESP.getFlashChipSize();
			
			DEBUG_PRINTLN();
			DEBUG_PRINT(F("Flash size: "));
			DEBUG_PRINT(flash_size);
			DEBUG_PRINTLN(F(" bytes"));			

			#if defined(ESP32_LIST_PARTITIONS)
			DEBUG_PRINTLN(F("ESP32 Partition table:"));

