dulgerov/OpenSprinkler-Firmware-ESP32-more-MQTT/OpenSprinkler.cpp
			DEBUG_PRINTLN(F("| Type | Sub |  Offset  |   Size   |       Label      |"));
			DEBUG_PRINTLN(F("| ---- | --- | -------- | -------- | ---------------- |"));
			
			esp_partition_iterator_t pi = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
			if (pi != NULL) {
				do {
				const esp_partition_t* p = esp_partition_get(pi);
				printf("|  %02x  | %02x  | 0x%06X | 0x%06X | %-16s |\r\n", 
					p->type, p->subtype, p->address, p->size, p->label);
				} while (pi = (esp_partition_next(pi)));
			}
			#endif
		if(!LittleFS.begin(ESP32_FORMAT_FS_IF_FAILED)) {
		#endif

			// !!! flash init failed, stall as we cannot proceed
			lcd.setCursor(0, 0);
			lcd_print_pgm(PSTR("Error Code: 0x2D"));
			DEBUG_PRINTLN(F("FAILED."));
			delay(10000);
			//reboot_dev(REBOOT_CAUSE_PROGRAM);
		} else {
			ESP32_listDir("/",2);
			
			//ESP32_readFile(IOPTS_FILENAME);
		}
		DEBUG_PRINTLN(F("Done."));
		lcd.clear(0,0);
		lcd.clear(0,1);
		lcd.clear(0,2);

		state = OS_STATE_INITIAL;

	#else

		// set sd cs pin high to release SD
		pinMode(PIN_SD_CS, OUTPUT);
		digitalWrite(PIN_SD_CS, HIGH);

		if(!sd.begin(PIN_SD_CS, SPI_HALF_SPEED)) {
			// !!! sd card not detected, stall as we cannot proceed
			lcd.setCursor(0, 0);
			lcd_print_pgm(PSTR("Error Code: 0x2D"));
			while(1){}
		}

	#endif

	// set button pins
	// enable internal pullup
	pinMode(PIN_BUTTON_1, INPUT_PULLUP);
	pinMode(PIN_BUTTON_2, INPUT_PULLUP);
	pinMode(PIN_BUTTON_3, INPUT_PULLUP);

	// Rotary knob setup should happen here!

	// detect and check RTC type
	DEBUG_PRINT(F("Detecting RTC..."));
	RTC.detect();
	DEBUG_PRINTLN(F("done."));

	#if defined(ESP32)
		// workaround for OTF 
		start_network_ap(wifi_ssid.c_str(),wifi_pass.c_str());
	#endif

#else
	//DEBUG_PRINTLN(get_runtime_path());
#endif
}

#if defined(ESP8266) || defined(ESP32)
/** LATCH boost voltage
 *
 */
void OpenSprinkler::latch_boost(unsigned char volt) {
	// if volt is 0 or larger than max volt, ignore it and boost according to BOOST_TIME only
	if(volt==0 || volt>iopt_max[IOPT_LATCH_ON_VOLTAGE]) {
		digitalWriteExt(PIN_BOOST, HIGH);      // enable boost converter
		delay((int)iopts[IOPT_BOOST_TIME]<<2); // wait for booster to charge
		digitalWriteExt(PIN_BOOST, LOW);       // disable boost converter
	} else {
    // boost to specified volt, up to time specified by BOOST_TIME
    uint16_t top = (uint16_t)(volt * 19.25f); // ADC = 1024 * volt * 1.5k / 79.8k
		if(analogRead(PIN_CURR_SENSE)>=top) return; // if the voltage has already reached top, return right away
    uint32_t boost_timeout = millis() + (iopts[IOPT_BOOST_TIME]<<2);
    digitalWriteExt(PIN_BOOST, HIGH);
    // boost until either top voltage is reached or boost timeout is reached
    while(millis()<boost_timeout && analogRead(PIN_CURR_SENSE)<top) {
      delay(5);
    }
    digitalWriteExt(PIN_BOOST, LOW);
	}
}

/** Set all zones (for LATCH controller)
 *  This function sets all zone pins (including COM) to a specified value
 */
void OpenSprinkler::latch_setallzonepins(unsigned char value) {
	digitalWriteExt(PIN_LATCH_COM, value);  // set latch com pin
	// Handle driver board (on main controller)
	if(drio->type==IOEXP_TYPE_9555) { // LATCH contorller only uses PCA9555, no other type
		uint16_t reg = drio->i2c_read(NXP_OUTPUT_REG);  // read current output reg value
		if(value) reg |= 0x00FF;  // first 8 zones are the lowest 8 bits of main driver board
		else reg &= 0xFF00;
		drio->i2c_write(NXP_OUTPUT_REG, reg); // write value to register
	}
	// Handle all expansion boards
	for(unsigned char i=0;i<MAX_EXT_BOARDS/2;i++) {
		if(expanders[i]->type==IOEXP_TYPE_9555) {
			expanders[i]->i2c_write(NXP_OUTPUT_REG, value?0xFFFF:0x0000);
		}
	}
}

void OpenSprinkler::latch_disable_alloutputs_v2() {
	digitalWriteExt(PIN_LATCH_COMA, LOW);
	digitalWriteExt(PIN_LATCH_COMK, LOW);

	// latch v2 has a pca9555 the lowest 8 bits of which control all h-bridge anode pins
	drio->i2c_write(NXP_OUTPUT_REG, drio->i2c_read(NXP_OUTPUT_REG) & 0xFF00);
	// latch v2 has a 74hc595 which controls all h-bridge cathode pins
	drio->shift_out(V2_PIN_SRLAT, V2_PIN_SRCLK, V2_PIN_SRDAT, 0x00);

	// todo: handle expander
}

/** Set one zone (for LATCH controller)
 *  This function sets one specified zone pin to a specified value
 */
void OpenSprinkler::latch_setzonepin(unsigned char sid, unsigned char value) {
	if(sid<8) { // on main controller
		if(drio->type==IOEXP_TYPE_9555) { // LATCH contorller only uses PCA9555, no other type
			uint16_t reg = drio->i2c_read(NXP_OUTPUT_REG);  // read current output reg value
			if(value) reg |= (1<<sid);
			else reg &= (~(1<<sid));
			drio->i2c_write(NXP_OUTPUT_REG, reg);  // write value to register
		}
	} else {  // on expander
		unsigned char bid=(sid-8)>>4;
		uint16_t s=(sid-8)&0x0F;
		if(expanders[bid]->type==IOEXP_TYPE_9555) {
			uint16_t reg = expanders[bid]->i2c_read(NXP_OUTPUT_REG);  // read current output reg value
			if(value) reg |= (1<<s);
			else reg &= (~(1<<s));
			expanders[bid]->i2c_write(NXP_OUTPUT_REG, reg);
		}
	}
}

void OpenSprinkler::latch_setzoneoutput_v2(unsigned char sid, unsigned char A, unsigned char K) {
	if(A==HIGH && K==HIGH) return; // A and K must not be HIGH at the same time

	if(sid<8) { // on main controller
		// v2 latch driver has one PCA9555, the lowest 8-bits of which control all anode pins
		// and one 74HC595, which controls all cathod pins
		uint16_t reg = drio->i2c_read(NXP_OUTPUT_REG);
		if(A) reg |= (1<<sid); // lowest 8 bits of 9555 control output anodes
		else reg &= (~(1<<sid));
		drio->i2c_write(NXP_OUTPUT_REG, reg);

		drio->shift_out(V2_PIN_SRLAT, V2_PIN_SRCLK, V2_PIN_SRDAT, K ? (1<<sid) : 0);

	} else { // on expander
		// todo: handle expander
	}
}

/** LATCH open / close a station
 *
 */
void OpenSprinkler::latch_open(unsigned char sid) {
	if(hw_rev>=2) {
		DEBUG_PRINTLN(F("latch_open_v2"));
		latch_disable_alloutputs_v2(); // disable all output pins
		DEBUG_PRINTLN(F("boost on voltage: "));
		DEBUG_PRINTLN(iopts[IOPT_LATCH_ON_VOLTAGE]);
		latch_boost(iopts[IOPT_LATCH_ON_VOLTAGE]); // generate boost voltage
		digitalWriteExt(PIN_LATCH_COMA, HIGH); // enable COM+
		latch_setzoneoutput_v2(sid, LOW, HIGH); // enable sid-
		digitalWriteExt(PIN_BOOST_EN, HIGH); // enable output path
		delay(150);
		digitalWriteExt(PIN_BOOST_EN, LOW); // disabled output boosted voltage path
		latch_disable_alloutputs_v2(); // disable all output pins
	} else {
		latch_boost();  // boost voltage
		latch_setallzonepins(HIGH);  // set all switches to HIGH, including COM
		latch_setzonepin(sid, LOW); // set the specified switch to LOW
		delay(1); // delay 1 ms for all gates to stablize
		digitalWriteExt(PIN_BOOST_EN, HIGH); // dump boosted voltage
		delay(100);                          // for 100ms
		latch_setzonepin(sid, HIGH);  // set the specified switch back to HIGH
		digitalWriteExt(PIN_BOOST_EN, LOW);  // disable boosted voltage
	}
}

